tsung/20140401-0156/tsung.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client maxusers="300000" host="localhost" use_controller_vm="true"/>
  </clients>
  
  <servers>
  <server host="p.sberlabs.io" port="8080" type="tcp"/>
</servers>

<load>
  <arrivalphase phase="1" duration="1" unit="minute">
    <users maxnumber="300000" arrivalrate="5000" unit="second"/>
  </arrivalphase>
</load>

<options>
  <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
  </option>
</options>

  <sessions>
   <session name="http-example" probability="100" type="ts_http">
    <request> <http url="/img/p.png?mid=ajhjsdb" method="GET" version="1.1"/> </request>
   </session>
</sessions>

</tsung>